# Дан список A размера N (N — четное число). Вывести его элементы с четными
# номерами в порядке возрастания номеров: A2, A4, A6, ..., AN. Условный оператор не
# использовать.

list_a = [5, 10, 15, 20, 25, 30, 35, 40]
print("Список А:", list_a)
print("Элементы А2, А4, A6, ...:", list_a[1::2])